app/controllers/api/contacts_controller.rb

SELECT "contact_lists".* FROM "contact_lists"
---
  def index
    @contacts = ContactList.all