app/controllers/api/contacts_controller.rb

SELECT "contact_lists".* FROM "contact_lists" WHERE (first_name ILIKE '%Kirk%' OR middle_name ILIKE '%Kirk%' OR last_name ILIKE '%Kirk%')
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 1]]
---
  def index
    if current_user
      @contacts = current_user.contact_lists

      if params[:search]
        @contacts = @contacts.where("first_name ILIKE ? OR middle_name ILIKE ? OR last_name ILIKE ?", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%")

INSERT INTO "contact_lists" ("first_name", "last_name", "email", "phone_number", "created_at", "updated_at", "middle_name", "bio", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @contact = ContactList.new(
      first_name: params[:first_name],
      middle_name: params[:middle_name],
      last_name: params[:last_name],
      bio: params[:bio],
      email: params[:email],
      phone_number: params[:phone_number],
    )
    if @contact.save

SELECT "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @contact = ContactList.find_by(id: params[:id])

SELECT "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "contact_lists" SET "middle_name" = $1, "bio" = $2, "updated_at" = $3 WHERE "contact_lists"."id" = $4  [["middle_name", "Rhaegar"], ["bio", "Lord Commander of the Nights Watch"], ["updated_at", "2019-11-13 02:33:02.158272"], ["id", 1]]
---
  def update
    @contact = ContactList.find_by(id: params[:id])
    @contact.first_name = params[:first_name] || @contact.first_name
    @contact.middle_name = params[:middle_name] || @contact.middle_name
    @contact.last_name = params[:last_name] || @contact.last_name
    @contact.bio = params[:bio] || @contact.bio
    @contact.email = params[:email] || @contact.email
    @contact.phone_number = params[:phone_number] || @contact.phone_number
    if @contact.save