app/controllers/application_controller.rb

SELECT "contact_lists".* FROM "contact_lists" ORDER BY "contact_lists"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def first_contact_call
    db_extract = ContactList.first